from typing import Dict

normal = "abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ`~!@#$%^&*()_-=+{}[]:;?"

tiny_texts = "ᵃᵇᶜᵈᵉᶠᵍʰᶦʲᵏᶫᵐᶰᵒᵖᑫʳˢᵗᵘᵛʷˣʸᶻᴬᴮᶜᴰᴱᶠᴳᴴᴵᴶᴷᴸᴹᴺᴼᴾᑫᴿˢᵀᵁⱽᵂˣʸᶻ`~﹗@#﹩﹪^﹠﹡⁽⁾⁻⁻⁼+{}[]﹕﹔﹖"
tiny_text_map: Dict[int, int] = str.maketrans(normal, tiny_texts)

bubble_texts = "ⓐⓑⓒⓓⓔⓕⓖⓗⓘⓙⓚⓛⓜⓝⓞⓟⓠⓡⓢⓣⓤⓥⓦⓧⓨⓩⓐⓑⓒⓓⓔⓕⓖⓗⓘⓙⓚⓛⓜⓝⓞⓟⓠⓡⓢⓣⓤⓥⓦⓧⓨⓩ`~!@#$%^&⊛()_⊖=+{}[]:;?"
bubble_text_map: Dict[int, int] = str.maketrans(normal, bubble_texts)

black_bubble_texts = "🅐🅑🅒🅓🅔🅕🅖🅗🅘🅙🅚🅛🅜🅝🅞🅟🅠🅡🅢🅣🅤🅥🅦🅧🅨🅩🅐🅑🅒🅓🅔🅕🅖🅗🅘🅙🅚🅛🅜🅝🅞🅟🅠🅡🅢🅣🅤🅥🅦🅧🅨🅩`~!@#$%^&⊛()_⊖=+{}[]:;?"
black_bubble_text_map: Dict[int, int] = str.maketrans(normal, black_bubble_texts)

cursive_texts = "𝒶𝒷𝒸𝒹ℯ𝒻ℊ𝒽𝒾𝒿𝓀𝓁𝓂𝓃ℴ𝓅𝓆𝓇𝓈𝓉𝓊𝓋𝓌𝓍𝓎𝓏𝒜ℬ𝒞𝒟ℰℱ𝒢ℋℐ𝒥𝒦ℒℳ𝒩𝒪𝒫𝒬ℛ𝒮𝒴𝒰𝒱𝒲𝒳Y𝒵`~!@#$%^&*()_-=+{}[]:;?"
cursive_text_map: Dict[int, str] = str.maketrans(normal, cursive_texts)
